Revit 2026 API

# FabricationConnectorInfoIsBodyConnectorLocked Property

---

Fabrication body connector lock.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsBodyConnectorLocked { get; set; }
```
```vb
Public Property IsBodyConnectorLocked As Boolean
	Get
	Set
```
```cpp
public:
property bool IsBodyConnectorLocked {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsBodyConnectorLocked : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: the connector cannot be modified on an owned fabrication part. -or- When setting this property: the connector is already connected. -or- When setting this property: the fabrication part is connected to more than one item. |

If set this prevents the connector value being overridden by the fabrication specification.

#### Reference

FabricationConnectorInfo Class

Autodesk.Revit.DB Namespace